In [3]:
import pandas as pd 
import numpy as np

In [4]:
df = pd.read_csv("C:/Users/PC/Desktop/pandas/insurance.csv")
df

      age     sex     bmi  children smoker     region      charges
0      19  female  27.900         0    yes  southwest  16884.92400
1      18    male  33.770         1     no  southeast   1725.55230
2      28    male  33.000         3     no  southeast   4449.46200
3      33    male  22.705         0     no  northwest  21984.47061
4      32    male  28.880         0     no  northwest   3866.85520
...   ...     ...     ...       ...    ...        ...          ...
1333   50    male  30.970         3     no  northwest  10600.54830
1334   18  female  31.920         0     no  northeast   2205.98080
1335   18  female  36.850         0     no  southeast   1629.83350
1336   21  female  25.800         0     no  southwest   2007.94500
1337   61  female  29.070         0    yes  northwest  29141.36030

[1338 rows x 7 columns]

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1338 entries, 0 to 1337
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   age       1338 non-null   int64
 1   sex       1338 non-null   object
 2   bmi       1338 non-null   float64
 3   children  1338 non-null   int64
 4   smoker    1338 non-null   object
 5   region    1338 non-null   object
 6   charges   1338 non-null   float64
dtypes: float64(2), int64(2), object(3)
memory usage: 73.3+ KB

In [6]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
age,1338.0,39.207025,14.049960,18.0000,27.00000,39.000,51.000000,64.00000
bmi,1338.0,30.663397,6.098187,15.9600,26.29625,30.400,34.693750,53.13000
children,1338.0,1.094918,1.205493,0.0000,0.00000,1.000,2.000000,5.00000
charges,1338.0,13270.422265,12110.011237,1121.8739,4740.28715,9382.033,16639.912515,63770.42801

In [7]:
df.describe(include = "O").T

       count unique        top  freq
sex     1338      2       male   676
smoker  1338      2         no  1064
region  1338      4  southeast   364

In [8]:
df.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [9]:
df.tail()

      age     sex    bmi  children smoker     region     charges
1333   50    male  30.97         3     no  northwest  10600.5483
1334   18  female  31.92         0     no  northeast   2205.9808
1335   18  female  36.85         0     no  southeast   1629.8335
1336   21  female  25.80         0     no  southwest   2007.9450
1337   61  female  29.07         0    yes  northwest  29141.3603

### **Average age**

In [10]:
#df.age.mean()
df["age"].mean()

np.float64(39.20702541106129)

### **Average age by gender**

In [11]:
df.groupby(['sex'])[["age"]].mean()

              age
sex
female  39.503021
male    38.917160

In [12]:
df.groupby(['sex'])[["age"]].mean()

              age
sex
female  39.503021
male    38.917160

In [13]:
df.groupby(['sex']).get_group("female")[["age"]].mean()

C:\Users\PC\AppData\Local\Temp\ipykernel_9748\2175287748.py:1: FutureWarning: When grouping with a length-1 list-like, you will need to pass a length-1 tuple to get_group in a future version of pandas. Pass `(name,)` instead of `name` to silence this warning.
  df.groupby(['sex']).get_group("female")[["age"]].mean()

age    39.503021
dtype: float64

In [14]:
df.groupby(['sex']).get_group("male")[["age"]].mean()

C:\Users\PC\AppData\Local\Temp\ipykernel_9748\591252201.py:1: FutureWarning: When grouping with a length-1 list-like, you will need to pass a length-1 tuple to get_group in a future version of pandas. Pass `(name,)` instead of `name` to silence this warning.
  df.groupby(['sex']).get_group("male")[["age"]].mean()

age    38.91716
dtype: float64

In [15]:
df.groupby(['sex'])[["age"]].mean().reset_index()

      sex        age
0  female  39.503021
1    male  38.917160

### **Average age by gender and smoking**

In [16]:
df.groupby(['sex','smoker'])[["age"]].mean()

                     age
sex    smoker
female no      39.691042
       yes     38.608696
male   no      39.061896
       yes     38.446541

In [17]:
df.groupby(['sex','smoker'])[["age"]].mean().reset_index()

      sex smoker        age
0  female     no  39.691042
1  female    yes  38.608696
2    male     no  39.061896
3    male    yes  38.446541

In [18]:
df.groupby(['sex','smoker'])[["age"]].mean().reset_index()

      sex smoker        age
0  female     no  39.691042
1  female    yes  38.608696
2    male     no  39.061896
3    male    yes  38.446541

### **Average BMI**

In [19]:
df[["bmi"]]

         bmi
0     27.900
1     33.770
2     33.000
3     22.705
4     28.880
...      ...
1333  30.970
1334  31.920
1335  36.850
1336  25.800
1337  29.070

[1338 rows x 1 columns]

In [20]:
#df.bmi.mean()
df["bmi"].mean()

np.float64(30.66339686098655)

### **Average BMI by a. Smoking  b. Gender**

In [21]:
df.columns

Index(['age', 'sex', 'bmi', 'children', 'smoker', 'region', 'charges'], dtype='object')

In [22]:
#a
df.groupby("smoker")[["bmi"]].mean()

              bmi
smoker
no      30.651795
yes     30.708449

In [23]:
#b
df.groupby("sex")[["bmi"]].mean()

              bmi
sex
female  30.377749
male    30.943129

In [24]:
df.groupby("sex").get_group("male")[["bmi"]].mean()

bmi    30.943129
dtype: float64

In [25]:
df.groupby(["sex","smoker"])[["bmi"]].mean()

                     bmi
sex    smoker
female no      30.539525
       yes     29.608261
male   no      30.770580
       yes     31.504182

### **Average charges by a.gender  b.Number of children  c. Smoking**

In [26]:
df.columns

Index(['age', 'sex', 'bmi', 'children', 'smoker', 'region', 'charges'], dtype='object')

In [27]:
#a
df.groupby("sex")[["charges"]].mean()

             charges
sex
female  12569.578844
male    13956.751178

In [28]:
df.groupby("sex").get_group("female")[["charges"]].mean()

charges    12569.578844
dtype: float64

In [29]:
#b
df.groupby("children")[["charges"]].mean()

               charges
children
0         12365.975602
1         12731.171832
2         15073.563734
3         15355.318367
4         13850.656311
5          8786.035247

In [30]:
df.groupby("children").get_group(5)[["charges"]].mean()

charges    8786.035247
dtype: float64

In [31]:
#c
df.groupby("smoker")[["charges"]].mean()

             charges
smoker
no       8434.268298
yes     32050.231832

In [32]:
df.groupby("smoker").get_group("yes")[["charges"]].mean()

charges    32050.231832
dtype: float64

In [33]:
df.groupby(["sex","children","smoker"])[["charges"]].mean()

                             charges
sex    children smoker
female 0        no       7688.318863
                yes     30685.059887
       1        no       8758.560884
                yes     30264.253915
       2        no       9921.777645
                yes     31663.833195
       3        no      10128.716357
                yes     30681.604257
       4        no      13937.674562
       5        no       8544.113050
                yes     19023.260000
male   0        no       7530.806677
                yes     31902.398075
       1        no       7837.147396
                yes     32904.876848
       2        no       9020.567024
                yes     35297.837461
       3        no       9025.530139
                yes     33869.169434
       4        no      10305.014255
                yes     26532.276933
       5        no       7931.658310

### **New Column classification based on BMI degrees**

In [34]:
df["BMI Classification"] = np.nan

In [35]:
df.head()

,age,sex,bmi,children,smoker,region,charges,BMI Classification
0,19,female,27.900,0,yes,southwest,16884.92400,NaN
1,18,male,33.770,1,no,southeast,1725.55230,NaN
2,28,male,33.000,3,no,southeast,4449.46200,NaN
3,33,male,22.705,0,no,northwest,21984.47061,NaN
4,32,male,28.880,0,no,northwest,3866.85520,NaN

In [36]:
df.shape[0]

1338

In [37]:
for i in range (df.shape[0]):
    if df["bmi"][i] < 18:
        df["BMI Classification"][i] = "Underweight"
        
    elif df["bmi"][i] < 25:
        df["BMI Classification"][i] = "Normal weight"
    
    elif df["bmi"][i] < 30:
        df["BMI Classification"][i] = "Overweight"
    
    else:
        df["BMI Classification"][i] = "Obese"

C:\Users\PC\AppData\Local\Temp\ipykernel_9748\2114779878.py:9: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df["BMI Classification"][i] = "Overweight"
C:\Users\PC\AppData\Local\Temp\ipykernel_9748\2114779878.py:9: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["BMI Classification"][i] = "Overweight"
C:\Users\PC\AppData\Local\Temp\ipykernel_9748\2114779878.py:9: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'Overweight' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  df["BMI Classification"][i] = "Overweight"

In [38]:
df[["BMI Classification"]]

     BMI Classification
0            Overweight
1                 Obese
2                 Obese
3         Normal weight
4            Overweight
...                 ...
1333              Obese
1334              Obese
1335              Obese
1336         Overweight
1337         Overweight

[1338 rows x 1 columns]

In [39]:
df[["bmi","BMI Classification"]]

         bmi BMI Classification
0     27.900         Overweight
1     33.770              Obese
2     33.000              Obese
3     22.705      Normal weight
4     28.880         Overweight
...      ...                ...
1333  30.970              Obese
1334  31.920              Obese
1335  36.850              Obese
1336  25.800         Overweight
1337  29.070         Overweight

[1338 rows x 2 columns]

In [ ]:
"""
def classify_bmi(bmi):
    if bmi < 18.5:
        return "Underweight"
    elif bmi < 25:
        return "Normal weight"
    elif bmi < 30:
        return "Overweight"
    else:
        return "Obese"

df["BMI Classification"] = df["bmi"].apply(classify_bmi)
"""

'\ndef classify_bmi(bmi):\n    if bmi < 18.5:\n        return "Underweight"\n    elif bmi < 25:\n        return "Normal weight"\n    elif bmi < 30:\n        return "Overweight"\n    else:\n        return "Obese"\n\ndf["bmi_classification"] = df["bmi"].apply(classify_bmi)\n'

### **Average charges for the area**

In [41]:
df.groupby("region")[["charges"]].mean()

                charges
region
northeast  13406.384516
northwest  12417.575374
southeast  14735.411438
southwest  12346.937377

### **New classification by age BMI smoking**

In [42]:
def classify_risk(row):
    if (row["smoker"] == "yes") or (row["bmi"] >= 30) or (row["age"] > 50):
        return "High Risk"
    
    elif (30 <= row["age"] <= 50) and (25 <= row["bmi"] < 30):
        return "Medium Risk"
    
    else:
        return "Low Risk"

In [ ]:
df["risk_category"] = df.apply(classify_risk, axis=1)    # rows

In [46]:
df[["age", "bmi", "smoker", "risk_category"]]

      age     bmi smoker risk_category
0      19  27.900    yes     High Risk
1      18  33.770     no     High Risk
2      28  33.000     no     High Risk
3      33  22.705     no      Low Risk
4      32  28.880     no   Medium Risk
...   ...     ...    ...           ...
1333   50  30.970     no     High Risk
1334   18  31.920     no     High Risk
1335   18  36.850     no     High Risk
1336   21  25.800     no      Low Risk
1337   61  29.070    yes     High Risk

[1338 rows x 4 columns]

In [47]:
df[["age", "bmi", "smoker", "risk_category"]].head()

   age     bmi smoker risk_category
0   19  27.900    yes     High Risk
1   18  33.770     no     High Risk
2   28  33.000     no     High Risk
3   33  22.705     no      Low Risk
4   32  28.880     no   Medium Risk

### **Another (group by) s depended on your own opinion for for the data**

In [51]:
df.groupby(["smoker", "BMI Classification"])[["charges"]].mean().round(2)

                            charges
smoker BMI Classification
no     Normal weight        7761.81
       Obese                8842.69
       Overweight           8257.96
       Underweight          3510.95
yes    Normal weight       19924.20
       Obese               41557.99
       Overweight          22495.87
       Underweight         18756.47

### **Insights**
**Smokers always pay higher insurance charges regardless of their weight. However, obesity combined with smoking represents the highest cost category in the entire dataset**

###